Revit 2027 API
AdvancedWood.WoodRayEllipseZ2x Property
 The property labeled "Ratio between two radii of ray ellipse" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodRayEllipseZ2x { get; }
Public Shared ReadOnly Property WoodRayEllipseZ2x As String
	Get
public:
static property String^ WoodRayEllipseZ2x {
	String^ get ();
}
static member WoodRayEllipseZ2x : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace